Autodesk.Revit.DB.Structure.BoundaryConditions.AreCurveLoopsValid(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Checks if curve loops are valid for creating an area boundary conditions.
loops:
The curve loops to be checked.
Returns:
Returns true if curve loops are ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.SetLoops(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Sets the curve loops that define geometry of the area boundary conditions.
Remarks:
This method works for boundary conditions which are not constrained to their host.
This method works with hosted area boundary conditions only.
Curve Loop must be planar and not self-intersecting.
newLoops:
Loops that define new geometry of the area boundary conditions.
The curve loop collection should contain only closed loops.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the following requirements is not satisfied :
- curve loops newLoops are not planar
- curve loops newLoops  are self-intersecting
- curve loops newLoops contains zero length curves
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Boundary condition is not a BoundaryConditionsType::Area type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BoundaryConditions is not a hosted object.
-or-
This BoundaryConditions is constrained on host.
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.GetLoops
Returns curve loops that define geometry of the area boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Area type. Otherwise exception is thrown.
Returns:
The curve loop collection.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Boundary condition is not a BoundaryConditionsType::Area type.
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions.SetCurve(Autodesk.Revit.DB.Curve)
Sets the curve that defines geometry of the line boundary conditions.
Remarks:
This method works for boundary conditions which are not constrained to their host.
This method works with hosted line boundary conditions only.
The curve must be bounded.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Boundary condition is not a BoundaryConditionsType::Line type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BoundaryConditions is not a hosted object.
-or-
This BoundaryConditions is constrained on host.
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.GetCurve
Returns curve that define geometry of the line boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.
Returns:
The curve.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Boundary condition is not a BoundaryConditionsType::Line type.
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions.RemoveHostConstraint
Removes constraint from host for this boundary conditions.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
Boundary condition is a BoundaryConditionsType::Area and the host is an Analytical Panel with curved profile.
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.IsValidHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.BoundaryConditionsType)
Checks if the provided host id can host a boundary conditions of the provided type.
doc:
The document containing both the host and the boundary conditions.
hostId:
The id of the analytical element that is about to host a boundary conditions.
type:
The type of the boundary conditions that is about to be hosted.
Returns:
True if an area boundary conditions can be placed on the input host id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.IsValidPreset(Autodesk.Revit.DB.Structure.BoundaryConditionsPreset)
Checks whether the value set for boundary conditions preset is valid.
preset:
The value set to be verified.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.IsValidReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.BoundaryConditionsType,System.Boolean)
Checks if the provided reference can host a boundary conditions.
doc:
The document containing both the host and the boundary conditions.
reference:
A reference to an analytical element.
type:
The type of the boundary conditions that is about to be hosted.
isConstrainedOnHost:
A value indicating if the boundary conditions is constrained on host or not.
Returns:
True if a boundary conditions can be placed on the input host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CanCreateAreaBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Checks if the provided host can host an area boundary conditions.
doc:
The document containing both the host and the boundary conditions.
reference:
A reference to an analytical element.
isConstrainedOnHost:
A value indicating if the area boundary conditions is constrained on host or not.
loops:
The loops that define geometry of the area boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Returns:
True if an area boundary conditions can be placed on the input host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreateAreaBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new custom area boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
hostElemId:
The AnalyticalElement host element for the area boundary conditions.
loops:
The loops that define geometry of the area boundary conditions.
The curve loop collection should contain only closed loops.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 2 - "Area". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the following requirements is not satisfied :
- curve loops loops are not planar
- curve loops loops  are self-intersecting
- curve loops loops contains zero length curves
-or-
hostElemId is not a valid host for area boundary conditions.
-or-
Area boundary conditions already exist on the selected hostElemId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreateAreaBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new hosted area boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
reference:
A reference to an analytical element face.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 2 - "Area". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference is not a valid host for area boundary conditions.
-or-
Area boundary conditions already exist on the selected reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CanCreateLineBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.Curve)
Checks if the provided host can host a line boundary conditions.
doc:
The document containing both the host and the boundary conditions.
reference:
A reference to an analytical element.
isConstrainedOnHost:
A value indicating if the line boundary conditions is constrained on host or not.
curve:
Curve of the boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Returns:
True if a line boundary conditions can be placed on the input host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreateLineBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new custom line boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
hostElemId:
The AnalyticalElement host element for the line boundary conditions.
curve:
Curve of the boundary conditions.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:
A value indicating the X axis rotation option.
X_RotationSpringModulus:
Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 1 - "Line". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided curve is not supported.
-or-
The input curve is not bound.
-or-
hostElemId is not a valid host for line boundary conditions.
-or-
Line boundary conditions already exist on the selected hostElemId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreateLineBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new hosted line boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
reference:
A reference to an analytical element edge.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:
A value indicating the X axis rotation option.
X_RotationSpringModulus:
Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 1 - "Line". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference is not a valid host for line boundary conditions.
-or-
Line boundary conditions already exist on the selected reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CanCreatePointBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.XYZ)
Checks if the provided host can host a point boundary conditions.
doc:
The document containing both the host and the boundary conditions.
reference:
A reference to an analytical element.
isConstrainedOnHost:
A value indicating if the point boundary conditions is constrained on host or not.
point:
Position of the boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Returns:
True if a point boundary conditions can be placed on the input host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreatePointBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new custom point boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
hostElemId:
The AnalyticalElement host element for the point boundary conditions.
point:
The position of point boundary conditions, measured in decimal feet.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:
A value indicating the X axis rotation option.
X_RotationSpringModulus:
Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation:
A value indicating the Y axis rotation option.
Y_RotationSpringModulus:
Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation:
A value indicating the Z axis rotation option.
Z_RotationSpringModulus:
Rotation Spring Modulus for Z axis. Ignored if Z_Rotation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 0 - "Point". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostElemId is not a valid host for point boundary conditions.
-or-
Point boundary conditions already exist on the selected hostElemId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.CreatePointBoundaryConditions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new hosted point boundary conditions within the project.
doc:
The document in which to create the boundary conditions.
reference:
A reference to an analytical element end.
X_Translation:
A value indicating the X axis translation option.
X_TranslationSpringModulus:
Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:
A value indicating the Y axis translation option.
Y_TranslationSpringModulus:
Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:
A value indicating the Z axis translation option.
Z_TranslationSpringModulus:
Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:
A value indicating the X axis rotation option.
X_RotationSpringModulus:
Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation:
A value indicating the Y axis rotation option.
Y_RotationSpringModulus:
Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation:
A value indicating the Z axis rotation option.
Z_RotationSpringModulus:
Rotation Spring Modulus for Z axis. Ignored if Z_Rotation is not "Spring".
Returns:
If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 0 - "Point". Otherwise it returns null .
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference is not a valid host for point boundary conditions.
-or-
Point boundary conditions already exist on the selected reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.SketchId
Sketch associated to this Revit element.
Remarks:
Boundary conditions may not have a valid sketch.
To edit the sketch profile you can use setLoops() or Autodesk::Revit::DB::SketchEditScope.
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.Preset
The boundary conditions preset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided BoundaryConditionsPreset preset is not supported for this boundary conditions type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.IsConstrainedOnHost
The boundary conditions is constrained to host or not.
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditions.Point
The position of point boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Boundary conditions is not a BoundaryConditionsType::Point type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This BoundaryConditions is not a hosted object.
-or-
When setting this property: This BoundaryConditions is constrained on host.

Autodesk.Revit.DB.Structure.BoundaryConditions.AssociatedLoadId
The Id of the internal load element associated with a boundary conditions.
Remarks:
ElementId may be set if the internal load exists and it's type fit the BoundaryConditions type only (Point, Line and Area).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: elementId is not a valid Element identifier.
-or-
When setting this property: ElementId does not refer to the internal load with appropriate type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions
An object that represents a force applied across an area.
Data members
Create methods
Properties